Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: Application this server handles, defaults to a L<Mojo::HelloWorld> object.
ja: Application this server handles, defaults to a [[Mojo::HelloWorld]] object.

source: As long as we haven't started a new transaction by invoking one of the C<*_ok> methods, the request and response objects from the previous transaction are available in the L<Test::Mojo> object:
ja: As long as we haven't started a new transaction by invoking one of the C<*_ok> methods, the request and response objects from the previous transaction are available in the [[Test::Mojo]] object:

source: Asset containing the uploaded data, usually a L<Mojo::Asset::File> or L<Mojo::Asset::Memory> object.
ja: Asset containing the uploaded data, usually a [[Mojo::Asset::File]] or [[Mojo::Asset::Memory]] object.

source: Attribute values passed to L<Mojo::Template> object used to preprocess configuration files.
ja: Attribute values passed to [[Mojo::Template]] object used to preprocess configuration files.

source: Attribute values passed to L<Mojo::Template> objects used to render templates with L</"render_data">, defaults to activating C<vars>.
ja: Attribute values passed to [[Mojo::Template]] objects used to render templates with [[/"render_data"]], defaults to activating C<vars>.

source: Attribute values passed to L<Mojo::Template> objects used to render templates.
ja: Attribute values passed to [[Mojo::Template]] objects used to render templates.

source: Authentication and code shared between multiple routes can be realized easily with routes generated by L<Mojolicious::Lite/"under">.
ja: 認証や複数のルーティングの間でコードを共有するためには、[[Mojolicious::Lite]]のC<under>構文を使う簡単です。

source: Automatically select best possible representation for resource from C<format> C<GET>/C<POST> parameter, C<format> stash value or C<Accept> request header, defaults to L<Mojolicious::Renderer/"default_format"> or rendering an empty C<204> response.
ja: Automatically select best possible representation for resource from C<format> C<GET>/C<POST> parameter, C<format> stash value or C<Accept> request header, defaults to [[Mojolicious::Renderer/"default_format"]] or rendering an empty C<204> response.

source: B<Examples:> The L<link checker|https://github.com/mojolicious/minion/tree/master/examples/linkcheck> will show you how to integrate background jobs into well-structured L<Mojolicious> applications.
ja: B<Examples:> The L<link checker|https://github.com/mojolicious/minion/tree/master/examples/linkcheck> will show you how to integrate background jobs into well-structured [[Mojolicious]] applications.

source: B<Examples:> The minimal L<chat|https://github.com/mojolicious/mojo-pg/tree/master/examples/chat.pl> application will show you how to scale WebSockets to multiple servers, and the well-structured L<blog|https://github.com/mojolicious/mojo-pg/tree/master/examples/blog> application how to apply the MVC design pattern in practice.
ja: B<Examples:> The minimal [[chat|https://github.com/mojolicious/mojo-pg/tree/master/examples/chat.pl]] application will show you how to scale WebSockets to multiple servers, and the well-structured [[blog|https://github.com/mojolicious/mojo-pg/tree/master/examples/blog]] application how to apply the MVC design pattern in practice.

source: Backend, usually a L<Mojo::Server::Morbo::Backend::Poll> object.
ja: Backend, usually a [[Mojo::Server::Morbo::Backend::Poll]] object.

source: Base classes used to identify controllers, defaults to L<Mojolicious::Controller> and L<Mojolicious>.
ja: Base classes used to identify controllers, defaults to [[Mojolicious::Controller]] and [[Mojolicious]].

source: Base of this URL, defaults to a L<Mojo::URL> object.
ja: Base of this URL, defaults to a [[Mojo::URL]] object.

source: Base64 decode bytes with L<MIME::Base64>.
ja: Base64 decode bytes with [[MIME::Base64]].

source: Base64 decode bytestream with L<Mojo::Util/"b64_decode">.
ja: Base64 decode bytestream with [[Mojo::Util/"b64_decode"]].

source: Base64 encode bytes with L<MIME::Base64>, the line ending defaults to a newline.
ja: Base64 encode bytes with [[MIME::Base64]], the line ending defaults to a newline.

source: Base64 encode bytestream with L<Mojo::Util/"b64_encode">.
ja: Base64 encode bytestream with [[Mojo::Util/"b64_encode"]].

source: Because of this, L<Mojolicious> contains a whole new HTTP client/server stack called L<Mojo>, which was heavily inspired by the original LWPng effort and carefully designed with these new requirements in mind.
ja: Because of this, [[Mojolicious]] contains a whole new HTTP client/server stack called [[Mojo]], which was heavily inspired by the original LWPng effort and carefully designed with these new requirements in mind.

source: Become a part of the ongoing L<Mojolicious> development.
ja: Become a part of the ongoing [[Mojolicious]] development.

source: Both application skeletons can be automatically generated with the commands L<Mojolicious::Command::Author::generate::lite_app> and L<Mojolicious::Command::Author::generate::app>.
ja: Both application skeletons can be automatically generated with the commands [[Mojolicious::Command::Author::generate::lite_app]] and [[Mojolicious::Command::Author::generate::app]].

source: Both have a higher precedence than routes for C<GET> and C<HEAD> requests.
ja: 両方とも優先度はC<GET>、C<HEAD>リクエストのルーティングよりも高くなります。

source: Broken dispatch chains can be continued by calling L<Mojolicious::Plugin::DefaultHelpers/"continue">, this allows for example, non-blocking operations to finish before reaching the next dispatch cycle.
ja: Broken dispatch chains can be continued by calling [[Mojolicious::Plugin::DefaultHelpers/"continue"]], this allows for example, non-blocking operations to finish before reaching the next dispatch cycle.

source: Build L<Mojo::Asset::File> or L<Mojo::Asset::Memory> object for a file, relative to L</"paths"> or from L</"classes">, or return C<undef> if it doesn't exist.
ja: Build [[Mojo::Asset::File]] or [[Mojo::Asset::Memory]] object for a file, relative to [[/"paths"]] or from [[/"classes"]], or return C<undef> if it doesn't exist.

source: Build L<Mojo::IOLoop::Delay> object to use as a promise and/or for flow-control.
ja: Build [[Mojo::IOLoop::Delay]] object to use as a promise and/or for flow-control.

source: Build L<Mojo::IOLoop::Subprocess> object to perform computationally expensive operations in subprocesses, without blocking the event loop.
ja: Build [[Mojo::IOLoop::Subprocess]] object to perform computationally expensive operations in subprocesses, without blocking the event loop.

source: Build L<Mojo::Transaction::HTTP> follow-up request for C<301>, C<302>, C<303>, C<307> or C<308> redirect response if possible.
ja: Build [[Mojo::Transaction::HTTP> follow-up request for C<301]], C<302]], C<303>, C<307> or C<308> redirect response if possible.

source: Build L<Mojo::Transaction::HTTP> object and emit L</"after_build_tx"> hook.
ja: Build [[Mojo::Transaction::HTTP]] object and emit [[/"after_build_tx"]] hook.

source: Build L<Mojo::Transaction::HTTP> proxy C<CONNECT> request for transaction if possible.
ja: Build [[Mojo::Transaction::HTTP]] proxy C<CONNECT> request for transaction if possible.

source: Build L<Mojo::Transaction::WebSocket> follow-up transaction for WebSocket handshake if possible.
ja: Build [[Mojo::Transaction::WebSocket]] follow-up transaction for WebSocket handshake if possible.

source: Build L<Mojolicious::Validator::Validation> object to perform validations.
ja: Build [[Mojolicious::Validator::Validation]] object to perform validations.

source: Build application from class and assign it to L</"app">.
ja: Build application from class and assign it to [[/"app"]].

source: Build default controller object with L</"controller_class">.
ja: Build default controller object with [[/"controller_class"]].

source: Build new L<Mojo::JSON::Pointer> object.
ja: Build new [[Mojo::JSON::Pointer]] object.

source: Build rejected L<Mojo::Promise> object or reject the promise with one or more rejection reasons.
ja: Build rejected [[Mojo::Promise]] object or reject the promise with one or more rejection reasons.

source: Build resolved L<Mojo::Promise> object or resolve the promise with one or more fulfillment values.
ja: Build resolved [[Mojo::Promise]] object or resolve the promise with one or more fulfillment values.

source: But because L<Test::Mojo> has access to everything that L<Mojo::UserAgent> does, we can introspect JSON documents as well as DOM-based documents (HTML, XML) with assertions that allow us to check for the existence of elements as well as inspect the content of text nodes.
ja: But because [[Test::Mojo]] has access to everything that [[Mojo::UserAgent]] does, we can introspect JSON documents as well as DOM-based documents (HTML, XML) with assertions that allow us to check for the existence of elements as well as inspect the content of text nodes.

source: But just like in L<Mojolicious::Lite> you can also pass the callback directly, which usually looks much better.
ja: But just like in [[Mojolicious::Lite]] you can also pass the callback directly, which usually looks much better.

source: But you can handle them manually by subscribing to the event L<Mojo::Reactor/"error"> or catching them inside the callback.
ja: But you can handle them manually by subscribing to the event [[Mojo::Reactor/"error"]] or catching them inside the callback.

source: By default, the L<Mojo::UserAgent> object in L<Test::Mojo> will manage session for us by saving and sending cookies automatically, just like common web browsers:
ja: By default, the [[Mojo::UserAgent]] object in [[Test::Mojo]] will manage session for us by saving and sending cookies automatically, just like common web browsers:

source: By now you've probably used many of the built-in commands described in L<Mojolicious::Commands>, but did you know that you can just add new ones and that they will be picked up automatically by the command line interface if they are placed in a directory from C<@INC>?
ja: By now you've probably used many of the built-in commands described in [[Mojolicious::Commands]], but did you know that you can just add new ones and that they will be picked up automatically by the command line interface if they are placed in a directory from C<@INC>?

source: C<CGI> is supported out of the box and your L<Mojolicious> application will automatically detect that it is executed as a C<CGI> script.
ja: C<CGI> is supported out of the box and your [[Mojolicious> application will automatically detect that it is executed as a C<CGI> script.

source: C<POST> parameters extracted from C<application/x-www-form-urlencoded> or C<multipart/form-data> message body, usually a L<Mojo::Parameters> object.
ja: C<POST> parameters extracted from C<application/x-www-form-urlencoded> or C<multipart/form-data> message body, usually a [[Mojo::Parameters]] object.

source: CGI and L<PSGI> environments can even be detected and will usually just work without commands.
ja: CGIまたは[[PSGI]] のどちらの環境であるかは自動的に検知されるため、通常はコマンドで指定しなくても動作します。

source: Callbacks will be passed along to L<Mojo::IOLoop::Subprocess/"run">.
ja: Callbacks will be passed along to [[Mojo::IOLoop::Subprocess/"run"]].

source: Callbacks will be passed along to L<Mojo::IOLoop::Delay/"steps">.
ja: Callbacks will be passed along to [[Mojo::IOLoop::Delay/"steps"]].

source: Calling this method without a chunk of data will finalize the L</"headers"> and allow for dynamic content to be written later.
ja: Calling this method without a chunk of data will finalize the [[/"headers"]] and allow for dynamic content to be written later.

source: Camelize bytestream with L<Mojo::Util/"camelize">.
ja: Camelize bytestream with [[Mojo::Util/"camelize"]].

source: Change validation L</"topic"> and apply filters.
ja: Change validation [[/"topic"]] and apply filters.

source: Change validation L</"topic">, apply filters, and make sure a value is present and not an empty string.
ja: Change validation [[/"topic"]], apply filters, and make sure a value is present and not an empty string.

source: Characters can be rendered to bytes with the C<text> stash value, the given content will be automatically encoded with L<Mojolicious::Renderer/"encoding">.
ja: Characters can be rendered to bytes with the C<text> stash value, the given content will be automatically encoded with [[Mojolicious::Renderer/"encoding"]].

source: Check active log L</"level">.
ja: Check active log [[/"level"]].

source: Check freshness of request by comparing the C<If-None-Match> and C<If-Modified-Since> request headers to the C<ETag> and C<Last-Modified> response headers with L<Mojolicious::Static/"is_fresh">.
ja: Check freshness of request by comparing the C<If-None-Match> and C<If-Modified-Since> request headers to the C<ETag> and C<Last-Modified> response headers with [[Mojolicious::Static/"is_fresh"]].

source: Check if JSON WebSocket message contains a value that can be identified using the given JSON Pointer with L<Mojo::JSON::Pointer>.
ja: Check if JSON WebSocket message contains a value that can be identified using the given JSON Pointer with [[Mojo::JSON::Pointer]].

source: Check if JSON response contains a value that can be identified using the given JSON Pointer with L<Mojo::JSON::Pointer>.
ja: Check if JSON response contains a value that can be identified using the given JSON Pointer with [[Mojo::JSON::Pointer]].

source: Check if L</"data"> contains a value that can be identified with the given JSON Pointer.
ja: Check if [[/"data"]] contains a value that can be identified with the given JSON Pointer.

source: Check if L</"input"> is available for validation.
ja: Check if [[/"input"]] is available for validation.

source: Check if asset has a L</"start_range"> or L</"end_range">.
ja: Check if asset has a [[/"start_range"]] or [[/"end_range"]].

source: Check if buffer has exceeded L</"max_buffer_size">.
ja: Check if buffer has exceeded [[/"max_buffer_size"]].

source: Check if content will be dynamically generated, which prevents L</"clone"> from working.
ja: Check if content will be dynamically generated, which prevents [[/"clone"]] from working.

source: Check if files from L</"watch"> have been modified since the last check and return an array reference with the results.
ja: Check if files from [[/"watch"]] have been modified since the last check and return an array reference with the results.

source: Check if first node in L</"tree"> matches the CSS selector.
ja: Check if first node in [[/"tree"]] matches the CSS selector.

source: Check if headers have exceeded L</"max_line_size"> or L</"max_lines">.
ja: Check if headers have exceeded [[/"max_line_size"]] or [[/"max_lines"]].

source: Check if message has exceeded L</"max_line_size">, L</"max_message_size">, L<Mojo::Content/"max_buffer_size"> or L<Mojo::Headers/"max_line_size">.
ja: Check if message has exceeded [[/"max_line_size"]], [[/"max_message_size"]], [[Mojo::Content/"max_buffer_size"]] or [[Mojo::Headers/"max_line_size"]].

source: Check if this response has a C<1xx> status L</"code">.
ja: Check if this response has a C<1xx> status [[/"code">.

source: Check if this response has a C<1xx>, C<204> or C<304> status L</"code">.
ja: Check if this response has a C<1xx>, C<204> or C<304> status [[/"code">.

source: Check if this response has a C<2xx> status L</"code">.
ja: Check if this response has a C<2xx> status [[/"code">.

source: Check if this response has a C<3xx> status L</"code">.
ja: Check if this response has a C<3xx> status [[/"code">.

source: Check if this response has a C<4xx> or C<5xx> status L</"code">.
ja: Check if this response has a C<4xx> or C<5xx> status [[/"code">.

source: Check if this response has a C<4xx> status L</"code">.
ja: Check if this response has a C<4xx> status [[/"code">.

source: Check if this response has a C<5xx> status L</"code">.
ja: Check if this response has a C<5xx> status [[/"code">.

source: Check if validation was successful and field has a value, defaults to checking the current L</"topic">.
ja: Check if validation was successful and field has a value, defaults to checking the current [[/"topic"]].

source: Check response content for exact match after retrieving it from L<Mojo::Message/"text">.
ja: Check response content for exact match after retrieving it from [[Mojo::Message/"text"]].

source: Check response content for similar match after retrieving it from L<Mojo::Message/"text">.
ja: Check response content for similar match after retrieving it from [[Mojo::Message/"text"]].

source: Check the value extracted from JSON WebSocket message using the given JSON Pointer with L<Mojo::JSON::Pointer> for similar match.
ja: Check the value extracted from JSON WebSocket message using the given JSON Pointer with [[Mojo::JSON::Pointer]] for similar match.

source: Check the value extracted from JSON WebSocket message using the given JSON Pointer with L<Mojo::JSON::Pointer>, which defaults to the root value if it is omitted.
ja: Check the value extracted from JSON WebSocket message using the given JSON Pointer with [[Mojo::JSON::Pointer]], which defaults to the root value if it is omitted.

source: Check the value extracted from JSON response using the given JSON Pointer with L<Mojo::JSON::Pointer> for similar match.
ja: Check the value extracted from JSON response using the given JSON Pointer with [[Mojo::JSON::Pointer]] for similar match.

source: Check the value extracted from JSON response using the given JSON Pointer with L<Mojo::JSON::Pointer>, which defaults to the root value if it is omitted.
ja: Check the value extracted from JSON response using the given JSON Pointer with [[Mojo::JSON::Pointer]], which defaults to the root value if it is omitted.

source: Checks for existence of the CSS selectors first matching HTML/XML element with L<Mojo::DOM/"at">.
ja: Checks for existence of the CSS selectors first matching HTML/XML element with [[Mojo::DOM/"at"]].

source: Checks text content of the CSS selectors first matching HTML/XML element for exact match with L<Mojo::DOM/"at">.
ja: Checks text content of the CSS selectors first matching HTML/XML element for exact match with [[Mojo::DOM/"at"]].

source: Checks text content of the CSS selectors first matching HTML/XML element for similar match with L<Mojo::DOM/"at">.
ja: Checks text content of the CSS selectors first matching HTML/XML element for similar match with [[Mojo::DOM/"at"]].

source: Checks the number of HTML/XML elements matched by the CSS selector with L<Mojo::DOM/"find">.
ja: Checks the number of HTML/XML elements matched by the CSS selector with [[Mojo::DOM/"find"]].

source: Class to be used for the default controller, defaults to L<Mojolicious::Controller>.
ja: Class to be used for the default controller, defaults to [[Mojolicious::Controller]].

source: Classes to use for finding files in C<DATA> sections with L<Mojo::Loader>, first one has the highest precedence, defaults to C<main>.
ja: Classes to use for finding files in C<DATA> sections with [[Mojo::Loader]], first one has the highest precedence, defaults to C<main>.

source: Classes to use for finding templates in C<DATA> sections with L<Mojo::Loader>, first one has the highest precedence, defaults to C<main>.
ja: Classes to use for finding templates in C<DATA> sections with [[Mojo::Loader]], first one has the highest precedence, defaults to C<main>.

source: Code has to be run through L<Perl::Tidy> with the included L<.perltidyrc|https://github.com/mojolicious/mojo/blob/master/.perltidyrc>, and everything should look like it was written by a single person.
ja: Code has to be run through [[Perl::Tidy]] with the included [[.perltidyrc|https://github.com/mojolicious/mojo/blob/master/.perltidyrc]], and everything should look like it was written by a single person.

source: Command line arguments are passed right through and there are many useful attributes and methods in L<Mojolicious::Command> that you can use or overload.
ja: Command line arguments are passed right through and there are many useful attributes and methods in [[Mojolicious::Command]] that you can use or overload.

source: Command line interface for your application, defaults to a L<Mojolicious::Commands> object.
ja: Command line interface for your application, defaults to a [[Mojolicious::Commands]] object.

source: Compare bytestream with L<Mojo::Util/"secure_compare">.
ja: Compare bytestream with [[Mojo::Util/"secure_compare"]].

source: Compress bytes with L<IO::Compress::Gzip>.
ja: Compress bytes with [[IO::Compress::Gzip]].

source: Compress bytestream with L<Mojo::Util/"gzip">.
ja: Compress bytestream with [[Mojo::Util/"gzip"]].

source: Conditions such as C<agent> and C<host> from L<Mojolicious::Plugin::HeaderCondition> allow even more powerful route constructs.
ja: [[Mojolicious::Plugin::HeaderCondition]] のC<agent>やC<host>といった条件 を使用すれば、より強力なルーティングを構築できます。

source: Conditions such as C<headers>, C<agent> and C<host> from L<Mojolicious::Plugin::HeaderCondition> can be applied to any route with the method L<Mojolicious::Routes::Route/"over">, and allow even more powerful route constructs.
ja: Conditions such as C<headers>, C<agent> and C<host> from [[Mojolicious::Plugin::HeaderCondition]] can be applied to any route with the method [[Mojolicious::Routes::Route/"over"]], and allow even more powerful route constructs.

source: Construct a new L<Mojo::Asset::File> object.
ja: Construct a new [[Mojo::Asset::File]] object.

source: Construct a new L<Mojo::Content::MultiPart> object and subscribe to L</"read"> event with default content parser.
ja: Construct a new [[Mojo::Content::MultiPart]] object and subscribe to [[/"read"]] event with default content parser.

source: Construct a new L<Mojo::Content::Single> object and subscribe to L</"read"> event with default content parser.
ja: Construct a new [[Mojo::Content::Single]] object and subscribe to [[/"read"]] event with default content parser.

source: Construct a new L<Mojo::DOM> object for an HTML/XML tag with or without attributes and content.
ja: Construct a new [[Mojo::DOM]] object for an HTML/XML tag with or without attributes and content.

source: Construct a new L<Mojo::Date> object and L</"parse"> date if necessary.
ja: Construct a new [[Mojo::Date]] object and [[/"parse"]] date if necessary.

source: Construct a new L<Mojo::Exception> object and assign L</"message"> if necessary.
ja: Construct a new [[Mojo::Exception]] object and assign [[/"message"]] if necessary.

source: Construct a new L<Mojo::File> object, defaults to using the current working directory.
ja: Construct a new [[Mojo::File]] object, defaults to using the current working directory.

source: Construct a new L<Mojo::IOLoop::Stream> object.
ja: Construct a new [[Mojo::IOLoop::Stream]] object.

source: Construct a new L<Mojo::Log> object and subscribe to L</"message"> event with default logger.
ja: Construct a new [[Mojo::Log]] object and subscribe to [[/"message"]] event with default logger.

source: Construct a new L<Mojo::Parameters> object and L</"parse"> parameters if necessary.
ja: Construct a new [[Mojo::Parameters]] object and [[/"parse"]] parameters if necessary.

source: Construct a new L<Mojo::Path> object and L</"parse"> path if necessary.
ja: Construct a new [[Mojo::Path]] object and [[/"parse"]] path if necessary.

source: Construct a new L<Mojo::Reactor::EV> object.
ja: Construct a new [[Mojo::Reactor::EV]] object.

source: Construct a new L<Mojo::Server> object and subscribe to L</"request"> event with default request handling.
ja: Construct a new [[Mojo::Server]] object and subscribe to [[/"request"]] event with default request handling.

source: Construct a new L<Mojo::URL> object and L</"parse"> URL if necessary.
ja: Construct a new [[Mojo::URL]] object and [[/"parse"]] URL if necessary.
